# Understand concepts here

Here first, I will try to understand the concepts using a small data set.

In [85]:
import pandas as pd

In [86]:
df = pd.DataFrame([
    {'firstName': 'Jhon', 'lastName': 'Wick', 'gender':'male'},
    {'firstName': 'Jack', 'lastName': 'Sparrow', 'gender':'male'},
    {'firstName': 'Maria', 'lastName': 'Sanchez', 'gender':'female'},
    {'firstName': 'Peter', 'lastName': 'Parker', 'gender':'male'},
])

df.head()

  firstName lastName  gender
0      Jhon     Wick    male
1      Jack  Sparrow    male
2     Maria  Sanchez  female
3     Peter   Parker    male

In [87]:
df.columns = ['first_name', 'last_name', 'gender']
df.head()

  first_name last_name  gender
0       Jhon      Wick    male
1       Jack   Sparrow    male
2      Maria   Sanchez  female
3      Peter    Parker    male

In [88]:
df.columns = [x.upper() for x in df.columns]
df.head()

  FIRST_NAME LAST_NAME  GENDER
0       Jhon      Wick    male
1       Jack   Sparrow    male
2      Maria   Sanchez  female
3      Peter    Parker    male

In [89]:
df['FIRST_NAME'] = [x.upper() for x in df['FIRST_NAME']]
df.head()

  FIRST_NAME LAST_NAME  GENDER
0       JHON      Wick    male
1       JACK   Sparrow    male
2      MARIA   Sanchez  female
3      PETER    Parker    male

In [90]:
df

  FIRST_NAME LAST_NAME  GENDER
0       JHON      Wick    male
1       JACK   Sparrow    male
2      MARIA   Sanchez  female
3      PETER    Parker    male

In [91]:
df.rename(columns={'FIRST_NAME': 'first_name'}, inplace=True)
df.head()

  first_name LAST_NAME  GENDER
0       JHON      Wick    male
1       JACK   Sparrow    male
2      MARIA   Sanchez  female
3      PETER    Parker    male

In [92]:
import pandas as pd

# Define the replacement dictionary
replacement = {"name": "NAME", "age": "Age", "school": "SchOOl"}

# Create a sample DataFrame with a "MainBranch" column
df = pd.DataFrame({"MainBranch": ["I am a name", "I am old", "I go to school"]})

# Replace values in "MainBranch" based on the dictionary
df["MainBranch"] = df["MainBranch"].replace(replacement, regex=True)

# Print the updated DataFrame
print(df)

       MainBranch
0     I am a NAME
1        I am old
2  I go to SchOOl

In [93]:
data = pd.DataFrame({
    "records": ["name", "age", "age", "name", "location", "address"]
})

replacements = {"name": "Naam", "age": "Umar", "location": "jagah"}

def replace_values(value):
    if value in replacements:
        return replacements[value]
    else:
        return None


data["records"] = data["records"].apply(replace_values)
print(data)

  records
0    Naam
1    Umar
2    Umar
3    Naam
4   jagah
5    None

In [94]:
td = pd.DataFrame([
    {'firstName': 'Jhon', 'lastName': 'Wick', 'gender':'male'},
    {'firstName': 'Jack', 'lastName': 'Sparrow', 'gender':'male'},
    {'firstName': 'Maria', 'lastName': 'Sanchez', 'gender':'female'},
    {'firstName': 'Peter', 'lastName': 'Parker', 'gender':'male'},
])
td.head()

  firstName lastName  gender
0      Jhon     Wick    male
1      Jack  Sparrow    male
2     Maria  Sanchez  female
3     Peter   Parker    male

In [95]:
td['firstName'] = td['firstName'].replace({'Jhon': 'A'})
td.head()

  firstName lastName  gender
0         A     Wick    male
1      Jack  Sparrow    male
2     Maria  Sanchez  female
3     Peter   Parker    male

In [96]:
td['full_name'] = td['firstName'] + ' ' + td['lastName']
td.head()

  firstName lastName  gender      full_name
0         A     Wick    male         A Wick
1      Jack  Sparrow    male   Jack Sparrow
2     Maria  Sanchez  female  Maria Sanchez
3     Peter   Parker    male   Peter Parker

In [97]:
td.drop(columns=['firstName', 'lastName'], inplace=True)
td

   gender      full_name
0    male         A Wick
1    male   Jack Sparrow
2  female  Maria Sanchez
3    male   Peter Parker

In [101]:
td[['first_name', 'last_name']] = td['full_name'].str.split(' ', expand=True)
td

   gender      full_name first_name last_name
0    male         A Wick          A      Wick
1    male   Jack Sparrow       Jack   Sparrow
2  female  Maria Sanchez      Maria   Sanchez
3    male   Peter Parker      Peter    Parker